'use script'
// Дан следующий объект:
// let obj = {
// 	key1: {
// 		key1: 1,
// 		key2: 2,
// 		key3: 3,
// 	},
// 	key2: {
// 		key1: 4,
// 		key2: 5,
// 		key3: 6,
// 	},
// 	key3: {
// 		key1: 7,
// 		key2: 8,
// 		key3: 9,
// 	},
// }

// Найдите сумму элементов приведенного объекта. 
// let obj = {
// 	key1: {
// 		key1: 1,
// 		key2: 2,
// 		key3: 3,
// 	},
// 	key2: {
// 		key1: 4,
// 		key2: 5,
// 		key3: 6,
// 	},
// 	key3: {
// 		key1: 7,
// 		key2: 8,
// 		key3: 9,
// 	},
// }
// let sum = 0 ;
// for (let key in obj){
//     console.log(key);
//     for (let key1 in obj[key]){
//         console.log(obj[key][key1]);
//         sum += obj[key][key1]
//     }
  
// }
// console.log(sum);


//  Дан следующий объект:
// let obj = {
// 	1: {
// 		1: 'a1',
// 		2: 'a2',
// 		3: 'a3',
// 	},
// 	2: {
// 		1: 'b1',
// 		2: 'b2',
// 		3: 'b3',
// 	},
// 	3: {
// 		1: 'c1',
// 		2: 'c2',
// 		3: 'c3',
// 	},
// }

// Выведите на экран элемент 'b2' и элемент 'c1'. 
// let obj = {
// 	1: {
// 		1: 'a1',
// 		2: 'a2',
// 		3: 'a3',
// 	},
// 	2: {
// 		1: 'b1',
// 		2: 'b2',
// 		3: 'b3',
// 	},
// 	3: {
// 		1: 'c1',
// 		2: 'c2',
// 		3: 'c3',
// 	},
// }
// console.log(obj[2][2] + '   ' + obj[3][1]);

//  Дан следующий объект:
// let obj = {
// 	key1: {
// 		a: 1, b: 2, c: {
// 			d: 3,
// 			e: 4,
// 		}, f: 5,
// 	},
// 	key2: {
// 		g: 6, h: 7,
// 	},
// }

// Найдите сумму всех элементов-чисел. 
// let obj = {
// 	key1: {
// 		a: 1, 
//         b: 2, 
//         c: {
// 			d: 3,
// 			e: 4,
// 		}, 
//         f: 5,
// 	},
// 	key2: {
// 		g: 6, 
//         h: 7,
// 	},
// }
// let sum = 0 ;
// for (let k1 in obj){
  
//     for ( let k2 in obj[k1])
//     {
    
//         console.log(obj[k1][k2]);
//         console.log(typeof obj[k1][k2]);
//         if (typeof obj[k1][k2] === 'number')
//         {
//             sum += obj[k1][k2]
//         }
//         else{
//             for ( let k3 in obj[k1][k2] ){
//                sum += obj[k1][k2][k3]
//             }
//         }
   
 
//     }
// }
// console.log(sum);

// Дан следующий объект:
// let obj = {
// 	1: {
// 		1: 11,
// 		2: 12,
// 		3: 13,
// 	},
// 	2: {
// 		1: 21,
// 		2: 22,
// 		3: 23,
// 	},
// 	3: {
// 		1: 24,
// 		2: 25,
// 		3: 26,
// 	},
// }

// Используя циклы, найдите сумму элементов этого объекта. 
// let obj = {
// 	1: {
// 		1: 11,
// 		2: 12,
// 		3: 13,
// 	},
// 	2: {
// 		1: 21,
// 		2: 22,
// 		3: 23,
// 	},
// 	3: {
// 		1: 24,
// 		2: 25,
// 		3: 26,
// 	},
// }
// let sum = 0 ;

// for ( let key in obj ){
//     for ( let key1 in obj[key]){
//         sum += obj[key][key1]

//     }
// }
// console.log(sum);

//  Дана вот такая структура для хранения списка дел за года, месяцы и дни:
// let affairs = {
// 	'2018': {
// 		11: {
// 			29: ['дело111', 'дело112', 'дело113'],
// 			30: ['дело121', 'дело122', 'дело123'],
// 		},
// 		12: {
// 			30: ['дело211', 'дело212', 'дело213'],
// 			31: ['дело221', 'дело222', 'дело223'],
// 		},
// 	},
// 	'2019': {
// 		12: {
// 			29: ['дело311', 'дело312', 'дело313'],
// 			30: ['дело321', 'дело322', 'дело323'],
// 			31: ['дело331', 'дело332', 'дело333'],
// 		}
// 	},
// }

// Пусть даны также 3 переменные, содержащие год, месяц и день.
//  Выведите дело, соответствующее значениям переменных. 
// let affairs = {
// 	'2018': {
// 		11: {
// 			29: ['дело111', 'дело112', 'дело113'],
// 			30: ['дело121', 'дело122', 'дело123'],
// 		},
// 		12: {
// 			30: ['дело211', 'дело212', 'дело213'],
// 			31: ['дело221', 'дело222', 'дело223'],
// 		},
// 	},
// 	'2019': {
// 		12: {
// 			29: ['дело311', 'дело312', 'дело313'],
// 			30: ['дело321', 'дело322', 'дело323'],
// 			31: ['дело331', 'дело332', 'дело333'],
// 		}
// 	},
// }
// let year = '2018' ;
// let month = 12 ;
// let day =31 ;
// console.log(affairs[year][month][day]);


//  Дан следующий массив работников:
// let employees = [
// 	{
// 		name: 'name1',
// 		salary: 300,
// 	},
// 	{
// 		name: 'name2',
// 		salary: 400,
// 	},
// 	{
// 		name: 'name3',
// 		salary: 500,
// 	},
// ];

// Выведите на экран сумму зарплат первого и второго работников. 

// let employees = [
// 	{
// 		name: 'name1',
// 		salary: 300,
// 	},
// 	{
// 		name: 'name2',
// 		salary: 400,
// 	},
// 	{
// 		name: 'name3',
// 		salary: 500,
// 	},
// ];
// let sum = employees[0].salary + employees[1].salary ;
// console.log(sum);

//  Дан следующий объект со студентами:
// let students = {
// 	'boys':  ['Коля', 'Вася', 'Петя'],
// 	'girls': ['Даша', 'Маша', 'Лена'],
// };

// Выведите на экран элемент 'Вася' и элемент 'Лена'. 
// let students = {
// 	'boys':  ['Коля', 'Вася', 'Петя'],
// 	'girls': ['Даша', 'Маша', 'Лена'],
// };
// console.log(students['boys'][1] + '  &  ' + students['girls'][2]);